app/controllers/chatroom_controller.rb

SELECT `messages`.* FROM `messages`
---
	def index

		@messages = Message.all