app/controllers/messages_controller.rb

INSERT INTO `messages` (`body`, `user_id`, `created_at`, `updated_at`) VALUES ('Lets go ', 1, '2022-03-21 13:36:08', '2022-03-21 13:36:08')
---
	def create

		message = current_user.messages.build(message_params)
		if message.save