app/models/message.rb

SELECT  `messages`.* FROM `messages` ORDER BY `messages`.`created_at` DESC LIMIT 5
---
	scope :custom_display, -> {order(:created_at).last(5) }